DeviceProcessEvents
| where FileName in~ ("AnyDesk.exe", "TeamViewer.exe", "logmein.exe", "GoToMyPC.exe", "AmmyyAdmin.exe")
| project Timestamp, DeviceName, FileName, ProcessCommandLine, InitiatingProcessParentFileName, AccountName
