assist me in creating a correlation search in splunk es consisting of the following query: index=windows (sourcetype="WinEventLog:Security" OR (sourcetype=WinEventLog AND source=WinEventLog:Security)) EventCode=4726  Target_Account_Name!=CliTest2 | table  CategoryString  ComputerName EventCode Subject_Account_Name Target_Account_Name name Type ;  titled Secops - Windows - AC-2(1) Account Deleted ; Provide details in a seperate sections for description,entities pulled from search, threat objects, risk message with fields from search, mitre attack technique,kill chain,nist, risk score and any other information you deem useful.
