title: PowerShell EncodedCommand Execution
id: 2f2a2c90-bd7c-4d94-bdc3-ec3a0535d13c
status: experimental
logsource:
  category: process_creation
  product: windows
detection:
  selection:
    CommandLine|contains: "powershell.exe"
    CommandLine|contains: "-EncodedCommand"
  condition: selection
level: high
tags:
  - attack.execution
  - attack.t1059.001
