index=wineventlog EventCode=4688
| search New_Process_Name="*\\procdump.exe" OR New_Process_Name="*\\lsass.exe"
| table _time, host, user, New_Process_Name, Command_Line
   title: Potential LSASS Memory Dump via Procdump
id: 9a57a3df-c4f3-47b8-86d2-2ddf26b2e874
status: experimental
logsource:
  category: process_creation
  product: windows
detection:
  selection:
    CommandLine|contains:
      - "procdump"
      - "lsass.exe"
  condition: selection
level: high
tags:
  - attack.credential_access
  - attack.t1003.001
