index=wineventlog (EventCode=4624 OR EventCode=4625)
| eval logonType=Logon_Type
| search logonType IN (2,10) 
| stats count by Account_Name, src_ip, dest_ip
| where count > 5


  title: Multiple Failed Logons (Possible Brute Force / Valid Accounts Abuse)
id: 6f82eaf2-d9df-4e4f-9dc5-1c67ec0a993d
status: experimental
logsource:
  category: authentication
  product: windows
detection:
  selection:
    EventID: 4625
  condition: selection
level: medium
tags:
  - attack.persistence
  - attack.t1078
