rule HermeticWiper_Registry_Modification
{
  meta:
    author = "Robert Clark"
    date = "2024-11-01"
    version = "1.0"
    description = "Detects HermeticWiper-style destructive registry modifications disabling crash dumps, color info, or system services"
    tactic = "{'TA0040': 'Impact'}"
    technique = "{'T1561.001': 'Disk Wipe: Disk Structure Wipe'}"
    reference = "https://www.microsoft.com/security/blog/2024/03/19/hermetic-wiper-new-wiper-malware-targeting-ukraine/"
    event_type = "REGISTRY_EVENT"

  events:
    // Registry modification to disable crash dumps
    $e1.metadata.log_type = "Windows_Sysmon"
    $e1.metadata.product_event_type = /13/
    $e1.target.registry.registry_key = /HKLM\\System\\CurrentControlSet\\Control\\CrashControl\\CrashDumpEnabled/
    $e1.additional.fields.value.string_value = /0x00000000/

    or
    // Registry modification to disable compressed color display
    $e2.metadata.log_type = "Windows_Sysmon"
    $e2.metadata.product_event_type = /1[23]/
    $e2.target.registry.registry_key = /HKLM\\SOFTWARE\\Microsoft\\Windows\\CurrentVersion\\Explorer\\Advanced\\ShowCompColor/
    $e2.additional.fields.value.string_value = /0x00000000/

    or
    // Registry modification disabling InfoTips or similar UI hints
    $e3.metadata.log_type = "Windows_Sysmon"
    $e3.metadata.product_event_type = /1[78]/
    $e3.target.registry.registry_key = /HKU\\.*\\SOFTWARE\\Microsoft\\Windows\\CurrentVersion\\Explorer\\Advanced\\ShowInfoTip/
    $e3.additional.fields.value.string_value = /0x00000000/

    or
    // Registry modification and process hash association for known HermeticWiper binaries
    $e4.metadata.log_type = "Windows_Sysmon"
    $e4.metadata.product_event_type = /12/
    $e4.target.registry.registry_key = /HKLM\\System\\CurrentControlSet\\Services/
    $e4.principal.process.file.sha256 in (
      "0385eeab00e946a302b24a91dea4187c1210597b8e17cd9e2230450f5ece21da",
      "1bc44eef75779e3ca1eefb8ff5a64807dbc942b1e4a2672d77b9f6928d292591",
      "e5f3ef69a534260e899a36cec459440dc572388defd8f1d98760d31c700f42d5",
      "b01e0c6ac0b8bcde145ab7b68cf246deea9402fa7ea3aede7105f7051fe240c1",
      "b6f2e008967c5527337448d768f2332d14b92de22a1279fd4d91000bb3d4a0fd",
      "fd7eacc2f87aceac865b0aa97a50503d44b799f27737e009f91f3c281233c17d"
    )

  outcome:
    Srisk_score = 50

  condition:
    any of ($e1, $e2, $e3, $e4)
}
