(`cim_Web_indexes`) sourcetype=iis 

| eval src_ip=coalesce(c_ip, src, src_ip, clientip) 

| search src_ip IN ( 

  "198.27.70.162","118.137.31.28","187.233.109.55","181.118.48.245", 

  "202.175.238.170","103.88.234.101","8.218.105.203","116.31.86.221", 

  "189.158.255.135","186.222.18.249","165.225.218.142","190.56.171.145", 

  "187.67.152.68","104.28.0.85","165.85.176.19","74.125.210.4", 

  "114.141.122.175","125.165.152.179","128.77.86.42","216.234.223.253", 

  "104.28.0.86","179.186.213.252" 

) 

| fillnull value="-" 

| stats  

    earliest(_time) as firsttime 

    latest(_time) as lasttime 

    count 

    values(cs_host) as site 

    values(cs_method) as method 

    values(status) as status 

    values(uri_path) as uri_path 

    values(uri_query) as uri_query 

    values(url) as url 

    values(useragent) as useragent 

  by src_ip 

| convert ctime(firsttime) ctime(lasttime) 

| sort - count 
