index=aws_bespin sourcetype=aws:cloudtrail eventSource="guardduty.amazonaws.com" 
    (eventName="CreateDetector" OR eventName="UpdateDetector" OR eventName="EnableOrganizationAdminAccount")
| stats count values(eventName) as eventName latest(_time) as last_seen by aws_account_id tenant_id
| convert ctime(last_seen)


index=aws_bespin sourcetype=aws:cloudtrail eventSource="guardduty.amazonaws.com"
| stats count values(eventName) as eventName earliest(_time) as first_seen latest(_time) as last_seen by aws_account_id tenant_id
| convert ctime(first_seen) ctime(last_seen)


index=aws_bespin sourcetype="aws:cloudwatch:guardduty"
| stats count values(detail.resourceDetails.ec2InstanceDetails.clusterArn) as ClusterARN by tenant account accountid


index=aws_bespin sourcetype="aws:cloudwatch:guardduty"
| stats count values(detail.resourceDetails.ec2InstanceDetails.clusterArn) as ClusterARN by tenant account detail.accountId


index=aws_bespin sourcetype="aws:cloudwatch:guardduty"
| stats values(detail.resourceDetails.ec2InstanceDetails.clusterArn) as ClusterARN by tenant detail.accountId
| stats count as num_accounts values(detail.accountId) as accounts by tenant
