## T1059 – Command and Scripting Interpreter (PowerShell)

### Splunk Query
```spl
index=windows EventCode=4104
| search ScriptBlockText="*" 
| eval is_encoded=if(like(ScriptBlockText,"%FromBase64String%") OR like(ScriptBlockText,"%Invoke-Expression%"), "yes","no")
| search is_encoded="yes"
| table _time, host, user, ScriptBlockText   

title: Multiple Failed Logons (Possible Brute Force / Valid Accounts Abuse)
id: 6f82eaf2-d9df-4e4f-9dc5-1c67ec0a993d
status: experimental
logsource:
  category: authentication
  product: windows
detection:
  selection:
    EventID: 4625
  condition: selection
level: medium
tags:
  - attack.persistence
  - attack.t1078
